from app.main_window.PaintApp import PaintApp


if __name__ == "__main__":
    # Создаем и запускаем приложение
    app = PaintApp()
    
    
#TODO
    # 7) Добавить возможность рисовать фигуры (линия,эллипс) - при нажатии на кнопку фигуры, пользователь выбирает фигуру, 
    # затем кликает и тянет мышью для рисования, фигуры должна быть либо закрашенной, либо с прозрачным фоном, в зависимости от выбора пользователя
    # 9) Добавить возможность отмены/повтора действий
    # 10) Добавить возможность открывать существующие изображения для редактирования
    # 12) При закрытии должно быть предложено сохранить изменения, если холст не пустой
    # 13) Масштаб +-, инструмент текст, заливка, рисование цилиндра
    # 14) Инкапсуляцию покрутить
    # 15) Пофиксить овал который появляется когда выбираешь кисть
    # 16) оконный менеджер
    # 17) Обработчик ошибок
    
#DONE
    # 2) Добавить "О программе" на главное окно
    # 0) Вынести кнопки в отдельную функцию
    # 4) Всплывающие подсказки для кнопок на панели инструментов
    # 3) Горячие клавиши
    # 5) Добавить возможность изменять размер кисти
    # 8) Добавить ластик
    # 1) BMP, JPG, PNG 
    # 6) Добавить возможность изменять размер холста
    # 11) Добавить возможность изменять цвет фона холста