from app.main_window.PaintApp import PaintApp


if __name__ == "__main__":
    # Создаем и запускаем приложение
    app = PaintApp()
    
    
#TODO
    # 1) Простое сохранение + диалог сохранения + BMP, JPG, PNG + имя файла не должно меняться если уже сохранено + должно запрашиваться имя файла
    # 3) Горячие клавиши, например ктрл в на закрытие окна, ктрл н на новое окно, ктрл с на очистить холст, ктрл с на выбор цвета, ктрл s на сохранение
    # 4) Всплывающие подсказки для кнопок на панели инструментов
    # 5) Добавить возможность изменять размер кисти
    # 6) Добавить возможность изменять размер холста
    # 7) Добавить возможность рисовать фигуры (линия,эллипс) - при нажатии на кнопку фигуры, пользователь выбирает фигуру, 
    # затем кликает и тянет мышью для рисования, фигуры должна быть либо закрашенной, либо с прозрачным фоном, в зависимости от выбора пользователя
    # 8) Добавить ластик
    # 9) Добавить возможность отмены/повтора действий
    # 10) Добавить возможность открывать существующие изображения для редактирования
    # 11) Добавить возможность изменять цвет фона холста
    # 12) При закрытии должно быть предложено сохранить изменения, если холст не пустой
    # 13) Масштаб +-, инструмент текст, заливка, рисование цилиндра
    # 14) Инкапсуляцию покрутить
    
#DONE
    # 2) Добавить "О программе" на главное окно
    # 0) Вынести кнопки в отдельную функцию
    